tap "homebrew/cask-fonts"

brew "autoconf"
brew "adguard"
brew "bat"
brew "chezmoi"
brew "cmake"
brew "curl"
brew "diff-so-fancy"
brew "fzf"
brew "git"
brew "jq"
brew "helm"
brew "htop"
brew "nvm"
brew "openjdk@11"
brew "podman"
brew "rename"
brew "terraform"
brew "tldr"
brew "tmux"
brew "vim"
brew "wget"
brew "zola"
brew "zsh""

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "caffeine"
cask "cyberduck"
cask "dash"
cask "datagrip"
cask "font-fira-code-nerd-font"
cask "gimp"
cask "intellij-idea"
cask "iterm2"
cask "keka"
cask "macdown"
cask "ngrok"
cask "notion"
cask "selfcontrol"
cask "signal"
cask "slack"
cask "spotify"
cask "textual"
cask "the-unarchiver"
cask "tower"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
