# Versent Homebrew Tap
tap "versent/taps"

# Common CLI tools
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat", greedy: true
# Modern resource monitor with better defaults
brew "bottom", greedy: true
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi", greedy: true
# Cross-platform make
brew "cmake", greedy: true
# Get a file from an HTTP, HTTPS or FTP server
brew "curl", greedy: true
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy", greedy: true
# Allow managing Dock entries
brew "dockutil", greedy: true
# Pretty disk free utility
brew "duf", greedy: true
# Intuitive disk usage utility
brew "dust", greedy: true
# Modern replacement for ls
brew "eza", greedy: true
# Simple, fast alternative to find
brew "fd", greedy: true
# Syntax-aware diff tool
brew "difftastic", greedy: true
# Command-line fuzzy finder written in Go
brew "fzf", greedy: true
# Distributed revision control system
brew "git", greedy: true
# Simple terminal UI for git commands
brew "lazygit", greedy: true
# Diffing utility
brew "git-delta"
# Automatic git commit --fixup
brew "git-absorb", greedy: true
# Improved top (interactive process viewer)
brew "htop", greedy: true
# Lightweight and flexible command-line JSON processor
brew "jq", greedy: true
# Mac App Store command-line interface
brew "mas", greedy: true
# Vim-fork focused on extensibility and usability
brew "neovim", greedy: true
# Global isolation of Python CLI applications
brew "pipx", greedy: true
# Modern replacement for ps
brew "procs", greedy: true
# Python
brew "python", greedy: true
# Perl-powered file rename script with many helpful built-ins
brew "rename", greedy: true
# Search tool like grep and The Silver Searcher
brew "ripgrep", greedy: true
# Simplified and community-driven man pages
brew "tldr", greedy: true
# Power-user shell
brew "starship", greedy: true
# Terminal multiplexer
brew "tmux", greedy: true
# Vi 'workalike' with many additional features
brew "vim", greedy: true
# Internet file retriever
brew "wget", greedy: true
# Shell extension to navigate your filesystem faster
brew "zoxide", greedy: true
# UNIX shell (command interpreter)
brew "zsh", greedy: true

# Window management
tap "koekeishiya/formulae"
brew "koekeishiya/formulae/yabai", greedy: true
brew "koekeishiya/formulae/skhd", greedy: true

# Common casks
# Password manager that keeps all passwords secure behind one password
cask "1password", greedy: true
# Command-line helper for the 1Password password manager
cask "1password-cli", greedy: true
# GPU-accelerated terminal emulator
cask "kitty", greedy: true
# Memory training application
cask "anki", greedy: true
# Application uninstaller
cask "appcleaner", greedy: true
# Server and cloud storage browser
cask "cyberduck", greedy: true
# Write, edit, and chat about your code with AI
cask "cursor", greedy: true
# Web browser
cask "firefox", greedy: true
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font", greedy: true
cask "font-jetbrains-mono-nerd-font", greedy: true
cask "font-sf-mono", greedy: true
cask "font-sf-pro", greedy: true
cask "font-space-mono-nerd-font", greedy: true
# Free and open-source image editor
cask "gimp", greedy: true
# File archiver
cask "keka", greedy: true
# Open-source Markdown editor
cask "macdown", greedy: true
# RSS Reader
cask "netnewswire", greedy: true
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian", greedy: true
# VPN service
cask "private-internet-access", greedy: true
# Catalogue of hi-res music for streaming and download
cask "qobuz", greedy: true
# Launcher
cask "raycast", greedy: true
# Block your own access to distracting websites
cask "selfcontrol", greedy: true
# Developer oriented font
cask "sf-symbols", greedy: true
# Instant messaging application focusing on security
cask "signal", greedy: true
# Team communication and collaboration software
cask "slack", greedy: true
# Unpacks archive files
cask "the-unarchiver", greedy: true
# Open-source code editor
cask "visual-studio-code", greedy: true
# Web browser
cask "vivaldi", greedy: true
# Multimedia player
cask "vlc", greedy: true
# Web browser
cask "zen", greedy: true


# Common Mac App Store apps
# Keep your Mac awake
mas "Amphetamine", id: 937984704
# Video editing software
mas "iMovie", id: 408981434
# Presentation software
mas "Keynote", id: 409183694
# Spreadsheet software
mas "Numbers", id: 409203825
# Word processor
mas "Pages", id: 409201541 


{{- if eq .proMachine "true" -}}
# Phrase Homebrew Tap
tap "phrase/brewed"
# HCL editor tap
tap "minamijoyo/hcledit"
# Terraform
tap "hashicorp/tap"

# Pro-specific CLI tools
# Extendable version manager with support for multiple languages
brew "asdf", greedy: true
# Official Amazon AWS command-line interface
brew "awscli", greedy: true
# Load and unload environment variables based on current directory
brew "direnv", greedy: true
# Pack, ship and run any application as a lightweight container
brew "docker", greedy: true
# Isolated development environments using Docker
brew "docker-compose", greedy: true
# Github CLI
brew "gh", greedy: true
# Kubernetes package manager
brew "helm", greedy: true
# User-friendly command-line HTTP tool
brew "httpie", greedy: true
# Command runner for project-specific tasks
brew "just", greedy: true
# Kubernetes command-line interface
brew "kubernetes-cli", greedy: true
# Shows the next meeting in the menu bar
cask "meetingbar", greedy: true
# Node version management
brew "n", greedy: true
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok", greedy: true
# User interface to the TELNET protocol
brew "telnet", greedy: true
# Tool to build, change, and version infrastructure
brew "hashicorp/tap/terraform", greedy: true
# Git hook scripts to identify and fix issues before submission
brew "pre-commit", greedy: true
# Generate documentation from Terraform modules
brew "terraform-docs", greedy: true
# Terraform linter for detecting errors and best practices
brew "tflint", greedy: true
# Cloud cost estimation tool for Terraform
brew "infracost", greedy: true
# HCL editor - Editor for HCL files
brew "minamijoyo/hcledit/hcledit", greedy: true

# Databases & SQL IDE
cask "datagrip", greedy: true
# Kubernetes Console
cask "headlamp", greedy: true
# Python IDE by JetBrains
cask "pycharm", greedy: true
# Postgres
cask "pgadmin4", greedy: true
# AWS & SSO
brew "saml2aws", greedy: true

{{ else }}
# Fast static site generator in a single binary with everything built-in
brew "zola"

# Voice and text chat software
cask "discord", greedy: true
# Application for interacting with Internet Relay Chat (IRC) chatrooms
cask "textual", greedy: true
{{- end -}}


